Repository: dxvrin/Pojav-Patch-iOS
Catalog: Natives/resources/*.lproj/Localizable.strings
Languages: km

# preference.title.auto_ram
source: Auto RAM
km: RAM ស្វ័យប្រវត្តិ

# preference.title.button_scale
source: On-screen button scale (%)
km: ទំហំប៊ូតុងលើអេក្រង់ (%)

# preference.title.check_sha
source: Check files after downloading
km: ពិនិត្យឯកសារបន្ទាប់ពីទាញយក

# preference.title.confirm
source: Are you sure?
km: តើអ្នកប្រាកដទេ?

# preference.title.confirm.delete_game_directory
source: The instance %@ will be deleted forever and cannot be restored.
km: Instance %@ នឹងត្រូវបានលុបជារៀងរហូត ហើយមិនអាចស្តារឡើងវិញបានទេ។

# preference.title.confirm.delete_runtime
source: %@ will be deleted
km: %@ នឹងត្រូវបានលុប

# preference.title.confirm.erase_demo_data
source: This will erase all Demo game versions and data used for Demo accounts.
km: វានឹងលុបកំណែហ្គេម Demo និងទិន្នន័យទាំងអស់ដែលប្រើសម្រាប់គណនី Demo។

# preference.title.confirm.reset_settings
source: This will remove all of your custom preferences, including resolution, button size, and Java arguments.
km: វានឹងលុបចោលរាល់ការកំណត់តាមបំណងរបស់អ្នក រួមទាំងកម្រិតភាពច្បាស់ ទំហំប៊ូតុង និង Java arguments។

# preference.title.cosmetica
source: Cosmetica Capes
km: អាវឃ្លុំ Cosmetica

# preference.title.custom_env
source: Environment variables
km: អថេរបរិស្ថាន

# preference.title.debug_always_attached_jit
source: Keep attached to StikDebug
km: រក្សាការភ្ជាប់ទៅ StikDebug

# preference.title.debug_auto_correction
source: Auto correction
km: ការកែស្វ័យប្រវត្តិ

# preference.title.debug_hide_home_indicator
source: Hide home indicator
km: លាក់ home indicator

# preference.title.debug_ipad_ui
source: Unlock iPadOS UI
km: ដោះសោ iPadOS UI

# preference.title.debug_skip_wait_jit
source: Skip "Waiting for JIT" dialog
km: រំលងផ្ទាំង "Waiting for JIT"

# preference.title.debug_universal_script_jit
source: Use Universal StikDebug Script
km: ប្រើ Universal StikDebug Script

# preference.title.default_gamepad_ctrl
source: Controller configuration
km: ការកំណត់ឧបករណ៍បញ្ជា

# preference.title.disable_haptics
source: Disable on-screen haptics
km: បិទ haptics លើអេក្រង់

# preference.title.done.erase_demo_data
source: All of the Demo game data has been erased.
km: ទិន្នន័យហ្គេម Demo ទាំងអស់ត្រូវបានលុប។

# preference.title.done.reset_settings
source: All of the default settings have been restored.
km: ការកំណត់លំនាំដើមទាំងអស់ត្រូវបានស្តារឡើងវិញ។

# preference.title.done.reset_warnings
source: All warnings have been reset.
km: ការព្រមានទាំងអស់ត្រូវបានកំណត់ឡើងវិញ។

# preference.title.enable_longPressTwoGesture
source: Long press two finger
km: ចុចឱ្យជាប់ម្រាមដៃពីរ

# preference.title.env_variables
source: Environment variables
km: អថេរបរិស្ថាន

# preference.title.erase_demo_data
source: Erase Demo game data
km: លុបទិន្នន័យហ្គេម Demo

# preference.title.fullscreen_airplay
source: Fullscreen AirPlay
km: AirPlay ពេញអេក្រង់

# preference.title.game_directory
source: Game directory
km: ថតហ្គេម

# preference.title.gesture_hotbar
source: Hotbar gestures
km: កាយវិការ Hotbar

# preference.title.gesture_mouse
source: Mouse gestures
km: កាយវិការកណ្តុរ

# preference.title.gyroscope_enable
source: Enable gyroscope controls
km: បើកការគ្រប់គ្រង gyroscope

# preference.title.gyroscope_invert_x_axis
source: Invert gyroscope left and right
km: បញ្ច្រាស gyroscope ឆ្វេង និងស្តាំ

# preference.title.gyroscope_sensitivity
source: Gyroscope controls sensitivity
km: ភាពរសើបនៃការគ្រប់គ្រង gyroscope

# preference.title.hardware_hide
source: Hide controls when hardware is connected
km: លាក់ការគ្រប់គ្រងនៅពេលភ្ជាប់ hardware

# preference.title.hidden_sidebar
source: Hide main menu sidebar by default
km: លាក់របារចំហៀងម៉ឺនុយមេតាមលំនាំដើម

# preference.title.manage_runtime
source: Manage runtimes
km: គ្រប់គ្រង runtimes

# preference.title.max_framerate
source: Maximum framerate
km: អត្រាស៊ុមអតិបរមា (FPS)

# preference.title.mouse_scale
source: Mouse scaling (%)
km: ទំហំកណ្តុរ (%)

# preference.title.mouse_speed
source: Mouse speed (%)
km: ល្បឿនកណ្តុរ (%)

# preference.title.performance_hud
source: Show Performance HUD
km: បង្ហាញ Performance HUD

# preference.title.press_duration
source: Long-press duration (ms)
km: រយៈពេលចុចឱ្យជាប់ (ms)

# preference.title.recording_hide
source: Hide controls from screen recording
km: លាក់ការគ្រប់គ្រងពីការថតអេក្រង់

# preference.title.renderer.angle
source: ANGLE (1.17-1.21.5) - exports OpenGL 3.2 (Core Profile, limited)
km: ANGLE (1.17-1.21.5) - នាំចេញ OpenGL 3.2 (Core Profile, កំណត់)

# preference.title.renderer.auto
source: Auto: holy gl4es or MobileGlues
km: ស្វ័យប្រវត្តិ: holy gl4es ឬ MobileGlues

# preference.title.renderer.gl4es
source: holy gl4es - exports OpenGL 2.1
km: holy gl4es - នាំចេញ OpenGL 2.1

# preference.title.renderer.mobileglues
source: MobileGlues (1.17+, Core Profile) - Export OpenGL 4.0
km: MobileGlues (1.17+, Core Profile) - នាំចេញ OpenGL 4.0

# preference.title.renderer.nggl4es
source: Krypton Wrapper (Experiment) - Export OpenGL 3.2
km: Krypton Wrapper (ពិសោធន៍) - នាំចេញ OpenGL 3.2

# preference.title.renderer.zink
source: Zink (Mesa 21.0) - exports OpenGL 4.1
km: Zink (Mesa 21.0) - នាំចេញ OpenGL 4.1

# preference.title.reset_settings
source: Reset all settings
km: កំណត់ការកំណត់ទាំងអស់ឡើងវិញ

# preference.title.reset_warnings
source: Reset all warnings
km: កំណត់ការព្រមានទាំងអស់ឡើងវិញ

# preference.title.resolution
source: Resolution (%)
km: កម្រិតភាពច្បាស់ (%)

# preference.title.silence_other_audio
source: Pause audio when game opens
km: ផ្អាកសំឡេងនៅពេលហ្គេមបើក

# preference.title.silence_with_switch
source: Disable audio with silent switch
km: បិទសំឡេងជាមួយ silent switch

# preference.title.slideable_hotbar
source: Slideable hotbar
km: Hotbar អាចអូសបាន

# preference.title.virtmouse_enable
source: Virtual mouse
km: កណ្តុរនិម្មិត

# preference.warn.allocated_memory
source: Due to limitations in the operating system itself, this option may cause instability at this and higher values. Proceed with caution.
km: ដោយសារតែការកម្រិតនៅក្នុងប្រព័ន្ធប្រតិបត្តិការផ្ទាល់ ជម្រើសនេះអាចបណ្តាលឱ្យមិនស្ថិតស្ថេរនៅតម្លៃនេះ និងខ្ពស់ជាងនេះ។ សូមបន្តដោយប្រុងប្រយ័ត្ន។

# preference.warn.auto_ram
source: Disabling this option on an unjailbroken device can create instability if altered. Proceed with caution.
km: ការបិទជម្រើសនេះលើឧបករណ៍ដែលមិនទាន់ jailbroken អាចបង្កើតភាពមិនស្ថិតស្ថេរប្រសិនបើផ្លាស់ប្តូរ។ សូមបន្តដោយប្រុងប្រយ័ត្ន។

# profile.detail.separate_preference
source: Enable this option to isolate any changes made in settings. Doing a Reset will restore to global settings instead of default settings.
km: បើកជម្រើសនេះដើម្បីញែកការផ្លាស់ប្តូរណាមួយដែលបានធ្វើនៅក្នុងការកំណត់។ ការធ្វើ Reset នឹងស្តារទៅការកំណត់សកលជំនួសឱ្យការកំណត់លំនាំដើម។

# profile.error.name_exists
source: A profile with that name already exists. Please use another name.
km: ប្រវត្តិរូបដែលមានឈ្មោះនោះមានរួចហើយ។ សូមប្រើឈ្មោះផ្សេង។

# profile.section.instance
source: Game Instance settings
km: ការកំណត់ Game Instance

# profile.section.profiles
source: Profiles in this instance
km: ប្រវត្តិរូបនៅក្នុង instance នេះ

# profile.title.create
source: Create new profile
km: បង្កើតប្រវត្តិរូបថ្មី

# profile.title.install_fabric_quilt
source: Install Fabric/Quilt
km: ដំឡើង Fabric/Quilt

# profile.title.separate_preference
source: Isolate settings
km: ញែកការកំណត់

# welcome.version
source: Version
km: កំណែ
