Repository: dxvrin/Pojav-Patch-iOS
Catalog: Natives/resources/*.lproj/Localizable.strings
Languages: km

source: Always
km: ជានិច្ច

source: Copy
km: ចម្លង

source: Details
km: ព័ត៌មានលម្អិត

source: Edit
km: កែសម្រួល

source: In game
km: ក្នុងហ្គេម

source: In menu
km: ក្នុងម៉ឺនុយ

source: Installed
km: បានដំឡើង

source: Move
km: ផ្លាស់ទី

source: News
km: ព័ត៌មាន

source: Play
km: លេង

source: Profiles
km: ប្រវត្តិរូប

source: Releases
km: កំណែផ្លូវការ

source: Remove
km: លុបចេញ

source: Resize
km: ប្តូរទំហំ

source: Settings
km: ការកំណត់

source: Unstable
km: មិនស្ថិតស្ថេរ

# controller_configurator.playstation.title.dpad_down
source: Down
km: ចុះក្រោម

# controller_configurator.playstation.title.dpad_left
source: Left
km: ឆ្វេង

# controller_configurator.playstation.title.dpad_right
source: Right
km: ស្តាំ

# controller_configurator.playstation.title.dpad_up
source: Up
km: ឡើងលើ

# controller_configurator.section.config_files
source: Current configuration file
km: ឯកសារកំណត់បច្ចុប្បន្ន

# controller_configurator.section.controller_style
source: Controller type
km: ប្រភេទឧបករណ៍បញ្ជា

# controller_configurator.section.footer.controller_style
source: Show different controller button names in this configurator.
km: បង្ហាញឈ្មោះប៊ូតុងឧបករណ៍បញ្ជាផ្សេងៗគ្នាក្នុងកម្មវិធីកំណត់នេះ។

# controller_configurator.section.footer.game_mappings
source: Bindings when the mouse is locked in game.
km: ការកំណត់ប៊ូតុងនៅពេលកណ្តុរត្រូវបានចាក់សោក្នុងហ្គេម។

# controller_configurator.section.footer.menu_mappings
source: Bindings when the mouse is not locked, such as on the title screen or in the pause menu.
km: ការកំណត់ប៊ូតុងនៅពេលកណ្តុរមិនត្រូវបានចាក់សោ ដូចជានៅលើអេក្រង់ចំណងជើង ឬក្នុងម៉ឺនុយផ្អាក។

# controller_configurator.section.game_mappings
source: Game mappings
km: ការកំណត់ក្នុងហ្គេម

# controller_configurator.section.menu_mappings
source: Menu mappings
km: ការកំណត់ក្នុងម៉ឺនុយ

# controller_configurator.title.current
source: Gamepad configuration file
km: ឯកសារកំណត់ Gamepad

# controller_configurator.xbox.title.dpad_down
source: Down
km: ចុះក្រោម

# controller_configurator.xbox.title.dpad_left
source: Left
km: ឆ្វេង

# controller_configurator.xbox.title.dpad_right
source: Right
km: ស្តាំ

# controller_configurator.xbox.title.dpad_up
source: Up
km: ឡើងលើ

# controller_configurator.xbox.title.thumb_left
source: Left thumbstick click
km: ចុច thumbstick ឆ្វេង

# controller_configurator.xbox.title.thumb_right
source: Right thumbstick click
km: ចុច thumbstick ស្តាំ

# custom_controls.button_edit.bg_color
source: Background color
km: ពណ៌ផ្ទៃខាងក្រោយ

# custom_controls.button_edit.corner_radius
source: Corner radius (%)
km: កាំជ្រុង (%)

# custom_controls.button_edit.forward_lock
source: Forward lock
km: ចាក់សោទៅមុខ

# custom_controls.button_edit.mapping
source: Mapping
km: ការកំណត់ប៊ូតុង

# custom_controls.button_edit.name
source: Name
km: ឈ្មោះ

# custom_controls.button_edit.opacity
source: Opacity (%)
km: ភាពស្រអាប់ (%)

# custom_controls.button_edit.orientation
source: Orientation
km: ទិសដៅ

# custom_controls.button_edit.size
source: Size
km: ទំហំ

# custom_controls.button_edit.stroke_color
source: Stroke color
km: ពណ៌បន្ទាត់ជុំវិញ

# custom_controls.button_edit.stroke_width
source: Stroke width (dp)
km: កម្រាស់បន្ទាត់ (dp)

# custom_controls.button_edit.swipeable
source: Swipeable
km: អាចអូសបាន

# custom_controls.button_edit.toggleable
source: Toggleable
km: អាចបិទបើកបាន

# custom_controls.button_edit.visibility
source: Visibility
km: ភាពមើលឃើញ

# custom_controls.button_menu.add_subbutton
source: Add sub-button
km: បន្ថែមប៊ូតុងរង

# custom_controls.control_menu.add_button
source: Add button
km: បន្ថែមប៊ូតុង

# custom_controls.control_menu.add_drawer
source: Add drawer
km: បន្ថែមថត

# custom_controls.control_menu.add_joystick
source: Add joystick
km: បន្ថែមយ៉យស្ទីក

# custom_controls.control_menu.discard_changes
source: Discard changes
km: បោះបង់ការផ្លាស់បង់

# custom_controls.control_menu.exit
source: Exit
km: ចាកចេញ

# custom_controls.control_menu.exit.warn
source: You are about to exit without saving changes.
km: អ្នកហៀបនឹងចាកចេញដោយមិនរក្សាទុកការផ្លាស់ប្តូរ។

# custom_controls.control_menu.load
source: Load
km: ផ្ទុក

# custom_controls.control_menu.make_default
source: Make default
km: កំណត់ជាលំនាំដើម

# custom_controls.control_menu.safe_area
source: Safe area
km: តំបន់សុវត្ថិភាព

# custom_controls.control_menu.save
source: Save
km: រក្សាទុក

# custom_controls.control_menu.save.error.json
source: JSON error
km: កំហុស JSON

# custom_controls.control_menu.save.error.write
source: Error saving file
km: កំហុសក្នុងការរក្សាទុកឯកសារ

# custom_controls.error.incompatible
source: This control version (code %d) is not implemented in this launcher build.
km: កំណែគ្រប់គ្រងនេះ (កូដ %d) មិនត្រូវបានអនុវត្តនៅក្នុងការបង្កើតកម្មវិធីនេះទេ។

# custom_controls.hint
source: Long-press anywhere on screen for more options
km: ចុចឱ្យជាប់កន្លែងណាមួយលើអេក្រង់សម្រាប់ជម្រើសបន្ថែម

# game.menu.confirm.force_close
source: Are you sure you want to force close?
km: តើអ្នកប្រាកដថាចង់បង្ខំបិទមែនទេ?

# game.menu.custom_controls
source: Custom controls
km: ការគ្រប់គ្រងតាមបំណង

# game.menu.force_close
source: Force close
km: បង្ខំបិទ

# game.note.airplay
source: Minecraft is being displayed in AirPlay mirrored display
km: Minecraft កំពុងត្រូវបានបង្ហាញនៅក្នុង AirPlay mirrored display

# game.title.exit_code
source: Game exited with code %d
km: ហ្គេមបានចាកចេញជាមួយកូដ %d

# init.migrateDir
source: The Pojav Patch data directory is now %@. All of your existing data has been moved to the new location.
km: ថតទិន្នន័យ Pojav Patch ឥឡូវនេះគឺ %@។ ទិន្នន័យដែលមានស្រាប់ទាំងអស់របស់អ្នកត្រូវបានផ្លាស់ទីទៅទីតាំងថ្មី។

# java.error.missing_main_class
source: %@ is missing main class attribute. If this is a mod, put it into the “mods” folder of your selected instance.
km: %@ ខ្វះគុណលក្ខណៈ main class។ ប្រសិនបើនេះជា mod សូមដាក់វាទៅក្នុងថត “mods” នៃ instance ដែលអ្នកបានជ្រើសរើស។

# java.error.missing_runtime
source: %@ requires Java %d or later to run. Please install it first and specify it in Manage Runtimes.
km: %@ ត្រូវការ Java %d ឬថ្មីជាងនេះដើម្បីដំណើរការ។ សូមដំឡើងវាជាមុនសិន ហើយបញ្ជាក់វានៅក្នុង Manage Runtimes។

# launcher.mcl.downloading_file
source: Downloading %@
km: កំពុងទាញយក %@

# launcher.mcl.error_download
source: Failed to download %@: %@
km: ការទាញយក %@ បរាជ័យ: %@

# launcher.menu.custom_controls
source: Custom controls
km: ការគ្រប់គ្រងតាមបំណង

# launcher.menu.execute_jar
source: Execute .jar
km: ដំណើរការ .jar

# launcher.wait_jit.message
source: Pojav Patch relies on Just-in-time compilation for Java to work at maximum performance.
km: Pojav Patch ពឹងផ្អែកលើការចងក្រង Just-in-time សម្រាប់ Java ដើម្បីដំណើរការក្នុងកម្រិតខ្ពស់បំផុត។

# launcher.wait_jit.title
source: Waiting for JIT
km: កំពុងរង់ចាំ JIT

# launcher.wait_jit_trollstore.message
source: If you still see this message, please enable URL Scheme in TrollStore.
km: ប្រសិនបើអ្នកនៅតែឃើញសារនេះ សូមបើក URL Scheme នៅក្នុង TrollStore។

# login.alert.field.username
source: Username
km: ឈ្មោះអ្នកប្រើប្រាស់

# login.error.username.outOfRange
source: Username must be at least 3 characters and a maximum of 16 characters
km: ឈ្មោះអ្នកប្រើប្រាស់ត្រូវតែមានយ៉ាងហោចណាស់ 3 តួអក្សរ និងអតិបរមា 16 តួអក្សរ

# login.jit.checking
source: Checking for JIT
km: កំពុងពិនិត្យមើល JIT

# login.jit.enabled
source: JIT has been enabled
km: JIT ត្រូវបានបើក

# login.jit.fail
source: JIT could not be enabled.
km: មិនអាចបើក JIT បានទេ។

# login.jit.fail.description
source: No integrations could be used to automatically enable JIT on your device, and it must now be enabled manually. Errors have been logged to latestlog.txt.
km: មិនមានការរួមបញ្ចូលណាដែលអាចប្រើដើម្បីបើក JIT ដោយស្វ័យប្រវត្តិនៅលើឧបករណ៍របស់អ្នកបានទេ ហើយឥឡូវនេះវាត្រូវតែបើកដោយដៃ។ កំហុសត្រូវបានកត់ត្រាទុកក្នុង latestlog.txt។

# login.jit.fail.description_unsupported
source: An unsupported installation method has been detected. Please reinstall using one of supported methods.
km: រកឃើញវិធីសាស្ត្រដំឡើងដែលមិនគាំទ្រ។ សូមដំឡើងឡើងវិញដោយប្រើវិធីសាស្ត្រណាមួយដែលត្រូវបានគាំទ្រ។

# login.jit.fail.title
source: JIT could not be enabled on your device.
km: មិនអាចបើក JIT នៅលើឧបករណ៍របស់អ្នកបានទេ។

# login.menu.sendlogs
source: Send your logs
km: ផ្ញើ logs របស់អ្នក

# login.msa.error.xsts.krverify
source: Your account needs to be verified by your parents before you can continue. Error code: 2148916236 or 2148916237.
km: គណនីរបស់អ្នកត្រូវតែត្រូវបានផ្ទៀងផ្ទាត់ដោយឪពុកម្តាយរបស់អ្នក មុនពេលអ្នកអាចបន្តបាន។ កូដកំហុស: 2148916236 ឬ 2148916237។

# login.msa.error.xsts.noxbox
source: Xbox Live is currently unavailable in your country. Error code: 2148916235
km: បច្ចុប្បន្ន Xbox Live មិនមាននៅក្នុងប្រទេសរបស់អ្នកទេ។ កូដកំហុស: 2148916235

# login.msa.error.xsts.noxboxacc
source: An Xbox profile is not registered for this Microsoft account. Please make sure that you have made an Xbox profile. Error code: 2148916233
km: ប្រវត្តិរូប Xbox មិនត្រូវបានចុះឈ្មោះសម្រាប់គណនី Microsoft នេះទេ។ សូមប្រាកដថាអ្នកបានបង្កើតប្រវត្តិរូប Xbox។ កូដកំហុស: 2148916233

# login.msa.error.xsts.underage
source: Your account needs to be linked to a parent account before you can continue. Error code: 2148916238
km: គណនីរបស់អ្នកត្រូវតែភ្ជាប់ទៅគណនីឪពុកម្តាយ មុនពេលអ្នកអាចបន្តបាន។ កូដកំហុស: 2148916238

# login.msa.progress.acquireAccessToken
source: (1/5) Acquiring the Access token
km: (1/5) កំពុងទទួលបាន Access token

# login.msa.progress.acquireMCToken
source: (4/5) Acquiring the Minecraft token
km: (4/5) កំពុងទទួលបាន Minecraft token

# login.msa.progress.acquireXBLToken
source: (2/5) Acquiring the Xbox Live token
km: (2/5) កំពុងទទួលបាន Xbox Live token

# login.msa.progress.acquireXSTS
source: Acquiring XSTS
km: កំពុងទទួលបាន XSTS

# login.msa.progress.acquireXboxProfile
source: (3/5) Acquiring the Xbox profile
km: (3/5) កំពុងទទួលបានប្រវត្តិរូប Xbox

# login.msa.progress.checkMCProfile
source: (5/5) Checking the Minecraft profile
km: (5/5) កំពុងពិនិត្យមើលប្រវត្តិរូប Minecraft

# login.option.add
source: Add account
km: បន្ថែមគណនី

# login.option.demo
source: Demo account
km: គណនីសាកល្បង (Demo)

# login.option.local
source: Local account
km: គណនីមូលដ្ឋាន (Local)

# login.option.microsoft
source: Microsoft account
km: គណនី Microsoft

# login.option.select
source: Select account
km: ជ្រើសរើសគណនី

# login.warn.message.demomode
source: As a replacement to offline and local mode, demo mode will allow you to sign into a Microsoft account that does not own the game and play the Java Edition trial, introduced in 1.3.1 and newer versions. Older versions contain the full game, as the official launcher does not place these restrictions. See our website to learn more about this transition from offline mode.
km: ជាការជំនួសឱ្យរបៀបក្រៅបណ្តាញ និងមូលដ្ឋាន របៀបសាកល្បងនឹងអនុញ្ញាតឱ្យអ្នកចូលទៅក្នុងគណនី Microsoft ដែលមិនមែនជាម្ចាស់ហ្គេម និងលេង Java Edition trial ដែលត្រូវបានណែនាំនៅក្នុងកំណែ 1.3.1 និងថ្មីជាងនេះ។ កំណែចាស់ៗមានហ្គេមពេញលេញ ដោយសារកម្មវិធីបើកដំណើរការផ្លូវការមិនដាក់កម្រិតទាំងនេះទេ។ សូមមើលគេហទំព័ររបស់យើងដើម្បីស្វែងយល់បន្ថែមអំពីការផ្លាស់ប្តូរនេះពីរបៀបក្រៅបណ្តាញ។

# login.warn.message.legacy_device
source: To run the next major release, a device capable of running iOS 14 is required.
km: ដើម្បីដំណើរការកំណែធំបន្ទាប់ ឧបករណ៍ដែលអាចដំណើរការ iOS 14 គឺត្រូវបានទាមទារ។

# login.warn.message.legacy_ios
source: To run the next major release, this device needs to be running iOS 14 or later.
km: ដើម្បីដំណើរការកំណែធំបន្ទាប់ ឧបករណ៍នេះត្រូវតែដំណើរការ iOS 14 ឬថ្មីជាងនេះ។

# login.warn.message.limited_ram
source: We recommend leaving auto RAM enabled to prevent instability and performance issues.
km: យើងសូមណែនាំឱ្យទុក RAM ស្វ័យប្រវត្តិឱ្យបើក ដើម្បីការពារបញ្ហាមិនស្ថិតស្ថេរ និងដំណើរការ។

# login.warn.message.localmode
source: You can continue to play installed versions, but you can no longer download Minecraft without a paid account. No support will be provided for issues with local accounts, or other means of acquiring Minecraft.
km: អ្នកអាចបន្តលេងកំណែដែលបានដំឡើង ប៉ុន្តែអ្នកមិនអាចទាញយក Minecraft ទៀតទេដោយគ្មានគណនីបង់ប្រាក់។ គ្មានការគាំទ្រណាមួយនឹងត្រូវបានផ្តល់ជូនសម្រាប់បញ្ហាជាមួយគណនីមូលដ្ឋាន ឬមធ្យោបាយផ្សេងទៀតនៃការទទួលបាន Minecraft ឡើយ។

# login.warn.title.demomode
source: Your account is Demo
km: គណនីរបស់អ្នកគឺជា Demo

# login.warn.title.legacy_device
source: The next release of Pojav Patch will not be compatible with this device.
km: កំណែបន្ទាប់របស់ Pojav Patch នឹងមិនឆបគ្នាជាមួយឧបករណ៍នេះទេ។

# login.warn.title.legacy_ios
source: The next release of Pojav Patch will require a system update.
km: កំណែបន្ទាប់របស់ Pojav Patch នឹងតម្រូវឱ្យមានការធ្វើបច្ចុប្បន្នភាពប្រព័ន្ធ។

# login.warn.title.limited_ram
source: This device has a limited amount of memory available.
km: ឧបករណ៍នេះមានអង្គចងចាំមានកំណត់។

# login.warn.title.localmode
source: Offline mode is now Local mode.
km: របៀបក្រៅបណ្តាញឥឡូវនេះគឺជា របៀបមូលដ្ឋាន។

# preference.detail.allocated_memory
source: Controls how much memory is given to Minecraft
km: គ្រប់គ្រងចំនួនអង្គចងចាំដែលត្រូវផ្តល់ឱ្យ Minecraft

# preference.detail.allow_microphone
source: Enable this only if you’re using voice chat mod. Silent switch option will be ignored, and audio quality from other apps will be affected.
km: បើកជម្រើសនេះ លុះត្រាតែអ្នកកំពុងប្រើ voice chat mod។ ជម្រើសបិទសំឡេងនឹងត្រូវបានមិនអើពើ ហើយគុណភាពសំឡេងពីកម្មវិធីផ្សេងទៀតនឹងរងផលប៉ះពាល់។

# preference.detail.appicon
source: Allows you to choose between different Home Screen icons for Pojav Patch.
km: អនុញ្ញាតឱ្យអ្នកជ្រើសរើសរវាងរូបតំណាងអេក្រង់ដើមផ្សេងៗគ្នាសម្រាប់ Pojav Patch។

# preference.detail.auto_ram
source: Enables automatic RAM adjuster
km: បើកដំណើរការកម្មវិធីកែសម្រួល RAM ស្វ័យប្រវត្តិ

# preference.detail.button_scale
source: Upscale them if buttons are too small, usually needed for iPad users.
km: ពង្រីកពួកវាប្រសិនបើប៊ូតុងតូចពេក ជាធម្មតាត្រូវការសម្រាប់អ្នកប្រើប្រាស់ iPad។

# preference.detail.check_sha
source: This option forces launcher to check the file hash if it's available. Prevents broken downloads.
km: ជម្រើសនេះបង្ខំឱ្យកម្មវិធីបើកដំណើរការពិនិត្យមើល hash ឯកសារប្រសិនបើវាមាន។ ការពារការទាញយកដែលខូច។

# preference.detail.cosmetica
source: Enable capes from Cosmetica (previously Arc). For more information please visit https://cosmetica.cc. Requires OptiFine
km: បើកអាវឃ្លុំពី Cosmetica (ពីមុនជា Arc)។ សម្រាប់ព័ត៌មានបន្ថែម សូមចូលទៅកាន់ https://cosmetica.cc។ ត្រូវការ OptiFine

# preference.detail.custom_env
source: This option is under construction. Create and edit custom_env.txt in the meantime.
km: ជម្រើសនេះកំពុងស្ថិតក្រោមការសាងសង់។ បង្កើត និងកែសម្រួល custom_env.txt ក្នុងពេលនេះ។

# preference.detail.debug_always_attached_jit
source: Enable this if your mods require loading .dylib at runtime. When this is on, StikDebug's PiP should not be closed during gameplay. Requies Universal Script enabled.
km: បើកជម្រើសនេះ ប្រសិនបើ mods របស់អ្នកតម្រូវឱ្យផ្ទុក .dylib នៅពេលដំណើរការ។ នៅពេលដែលវាបើក PiP របស់ StikDebug មិនគួរត្រូវបានបិទក្នុងអំឡុងពេលលេងហ្គេមឡើយ។ ត្រូវការបើក Universal Script។

# preference.detail.debug_auto_correction
source: Enable auto correction when typing text in game.
km: បើកការកែស្វ័យប្រវត្តិនៅពេលវាយអត្ថបទក្នុងហ្គេម។

# preference.detail.debug_hide_home_indicator
source: This will disable home indicator locking. You will need to use Guided Access to hide and lock home indicator at the same time.
km: វានឹងបិទការចាក់សោ home indicator។ អ្នកនឹងត្រូវប្រើ Guided Access ដើម្បីលាក់ និងចាក់សោ home indicator ក្នុងពេលតែមួយ។

# preference.detail.debug_ipad_ui
source: Unlock iPad-exclusive UI (alert, keyboard, etc.) if enabled or iPhone UI if disabled.
km: ដោះសោ UI ផ្តាច់មុខសម្រាប់ iPad (ការជូនដំណឹង ក្តារចុច ។ល។) ប្រសិនបើបើក ឬ iPhone UI ប្រសិនបើបិទ។

# preference.detail.debug_logging
source: Logs internal settings and actions to latestlog.txt. This helps the developers find issues easier, but Minecraft may run slower as the logs will be written to more often.
km: កត់ត្រាការកំណត់ខាងក្នុង និងសកម្មភាពទៅកាន់ latestlog.txt។ នេះជួយអ្នកអភិវឌ្ឍន៍ស្វែងរកបញ្ហាកាន់តែងាយស្រួល ប៉ុន្តែ Minecraft អាចដំណើរការយឺតជាងមុន ដោយសារ logs នឹងត្រូវបានសរសេរញឹកញាប់ជាងមុន។

# preference.detail.debug_skip_wait_jit
source: This does not allow you to launch without JIT, instead this skips debugger check, because check fails on certain jailbreaks.
km: វាមិនអនុញ្ញាតឱ្យអ្នកបើកដំណើរការដោយគ្មាន JIT ទេ ផ្ទុយទៅវិញវារំលងការពិនិត្យ debugger ពីព្រោះការពិនិត្យបរាជ័យលើ jailbreaks មួយចំនួន។

# preference.detail.enable_longPressTwoGesture
source: When enable, long press two finger will open keyboard.
km: នៅពេលបើក ការចុចឱ្យជាប់ដោយប្រើម្រាមដៃពីរនឹងបើកក្តារចុច។

# preference.detail.env_variables
source: Set custom environment variables when launching Minecraft. Be careful, this can make the game crash if modified incorrectly.
km: កំណត់អថេរបរិស្ថានតាមបំណងនៅពេលបើកដំណើរការ Minecraft។ សូមប្រុងប្រយ័ត្ន នេះអាចធ្វើឱ្យហ្គេមគាំងប្រសិនបើកែប្រែមិនត្រឹមត្រូវ។

# preference.detail.fullscreen_airplay
source: Allows presenting fullscreen game window on the external display rather than mirroring everything on screen.
km: អនុញ្ញាតឱ្យបង្ហាញផ្ទាំងហ្គេមពេញអេក្រង់នៅលើអេក្រង់ខាងក្រៅ ជាជាងការចម្លងអ្វីៗគ្រប់យ៉ាងនៅលើអេក្រង់។

# preference.detail.gesture_hotbar
source: Enables gestures, such as touch the hotbar slot, swap items between hand, throw items
km: បើកកាយវិការ ដូចជាការប៉ះរន្ធ hotbar ការប្តូររបស់របររវាងដៃ ការបោះរបស់របរ

# preference.detail.gesture_mouse
source: Enables gestures, such as tap to place block, hold to break block, scrolling with 2 fingers
km: បើកកាយវិការ ដូចជាការប៉ះដើម្បីដាក់ប្លុក ចុចឱ្យជាប់ដើម្បីបំបែកប្លុក ការអូសដោយប្រើម្រាមដៃ 2

# preference.detail.gyroscope_enable
source: Enabling this will allow you to turn in game by turning your device
km: ការបើកជម្រើសនេះនឹងអនុញ្ញាតឱ្យអ្នកបង្វិលក្នុងហ្គេមដោយបង្វិលឧបករណ៍របស់អ្នក

# preference.detail.gyroscope_invert_x_axis
source: Inverts the X-axis of the gyroscope
km: បញ្ច្រាសអ័ក្ស X នៃ gyroscope

# preference.detail.gyroscope_sensitivity
source: Adjust the sensitivity of gyroscope controls
km: កែតម្រូវភាពរសើបនៃការគ្រប់គ្រង gyroscope

# preference.detail.hardware_hide
source: Enable the behaviour of automatically disabling the on-screen control overlay when a mouse or game controller is connected.
km: បើកឥរិយាបថនៃការបិទការគ្រប់គ្រងលើអេក្រង់ដោយស្វ័យប្រវត្តិ នៅពេលដែលកណ្តុរ ឬឧបករណ៍បញ្ជាហ្គេមត្រូវបានភ្ជាប់។

# preference.detail.hidden_sidebar
source: Allows you to hide the sidebar on the main menu by default and when rotating.
km: អនុញ្ញាតឱ្យអ្នកលាក់របារចំហៀងនៅលើម៉ឺនុយមេតាមលំនាំដើម និងនៅពេលបង្វិល។

# preference.detail.java_args
source: Pass arguments to Java when launching Minecraft. Be careful, this can make the game crash if modified incorrectly.
km: បញ្ជូន arguments ទៅ Java នៅពេលបើកដំណើរការ Minecraft។ សូមប្រុងប្រយ័ត្ន នេះអាចធ្វើឱ្យហ្គេមគាំងប្រសិនបើកែប្រែមិនត្រឹមត្រូវ។

# preference.detail.mouse_speed
source: Change the speed of the virtual mouse
km: ផ្លាស់ប្តូរល្បឿននៃកណ្តុរនិម្មិត

# preference.detail.performance_hud
source: When available, show the performance monitoring overlay.
km: នៅពេលមាន សូមបង្ហាញផ្ទាំងត្រួតពិនិត្យដំណើរការ។

# preference.detail.press_duration
source: Trigger press duration for destroying blocks and dropping items.
km: រយៈពេលចុចកេះសម្រាប់ការបំផ្លាញប្លុក និងការទម្លាក់របស់របរ។

# preference.detail.recording_hide
source: Hides controls from screenshot and screen recording while they remain visible on the screen.
km: លាក់ការគ្រប់គ្រងពីការថតអេក្រង់ និងការថតវីដេអូ ខណៈពេលដែលពួកវានៅតែអាចមើលឃើញនៅលើអេក្រង់។

# preference.detail.renderer
source: Change the OpenGL render engine to use.
km: ផ្លាស់ប្តូរម៉ាស៊ីន OpenGL render ដែលត្រូវប្រើ។

# preference.detail.resolution
source: Allows you to decrease the game resolution.
km: អនុញ្ញាតឱ្យអ្នកកាត់បន្ថយកម្រិតភាពច្បាស់របស់ហ្គេម។

# preference.detail.silence_other_audio
source: Enable to allow Pojav Patch to pause audio from other apps, such as Music, when launching the game.
km: បើកដើម្បីអនុញ្ញាតឱ្យ Pojav Patch ផ្អាកសំឡេងពីកម្មវិធីផ្សេងទៀត ដូចជាតន្ត្រី នៅពេលបើកហ្គេម។

# preference.detail.silence_with_switch
source: Enable to disable audio when Silent Mode is on, and deny microphone input.
km: បើកដើម្បីបិទសំឡេងនៅពេលដែល Silent Mode បើក និងបដិសេធការបញ្ចូលមីក្រូហ្វូន។

# preference.detail.slideable_hotbar
source: Make the hotbar slideable like the mouse wheel
km: ធ្វើឱ្យ hotbar អាចអូសបានដូចជាកង់កណ្តុរ

# preference.detail.virtmouse_enable
source: Enable this option to start with virtual mouse on
km: បើកជម្រើសនេះដើម្បីចាប់ផ្តើមជាមួយកណ្តុរនិម្មិត

# preference.manage_runtime.default.1165
source: 1.16.5 and older
km: 1.16.5 និងចាស់ជាងនេះ

# preference.manage_runtime.default.117
source: 1.17 and newer
km: 1.17 និងថ្មីជាងនេះ

# preference.manage_runtime.footer.default
source: Minecraft 1.16.5 and older may run with a newer Java version, however compatibility with mods is not guaranteed. External runtimes can be placed in the “java_runtimes” folder. Changing Java version for “Execute .jar” only takes effect if the installer does not expect a newer Java version.
km: Minecraft 1.16.5 និងចាស់ជាងនេះអាចដំណើរការជាមួយកំណែ Java ថ្មីជាងនេះ ទោះជាយ៉ាងណាក៏ដោយ ភាពឆបគ្នាជាមួយ mods មិនត្រូវបានធានាទេ។ Runtimes ខាងក្រៅអាចត្រូវបានដាក់ក្នុងថត “java_runtimes”។ ការផ្លាស់ប្តូរកំណែ Java សម្រាប់ “Execute .jar” នឹងមានប្រសិទ្ធភាពលុះត្រាតែកម្មវិធីដំឡើងមិនរំពឹងថានឹងមានកំណែ Java ថ្មីជាងនេះ។

# preference.manage_runtime.footer.java17
source: This is the default version for Minecraft 1.17 and newer.
km: នេះគឺជាកំណែលំនាំដើមសម្រាប់ Minecraft 1.17 និងថ្មីជាងនេះ។

# preference.manage_runtime.footer.java8
source: This is the default version for Minecraft 1.16.5 and older.
km: នេះគឺជាកំណែលំនាំដើមសម្រាប់ Minecraft 1.16.5 និងចាស់ជាងនេះ។

# preference.manage_runtime.header.default
source: Preferred Java version
km: កំណែ Java ដែលពេញចិត្ត

# preference.manage_runtime.header.invalid
source: Invalid runtimes
km: Runtimes មិនត្រឹមត្រូវ

# preference.multidir.add_directory
source: add game directory
km: បន្ថែមថតហ្គេម

# preference.placeholder.env_variables
source: Specify variables...
km: បញ្ជាក់អថេរ...

# preference.placeholder.java_args
source: Specify arguments...
km: បញ្ជាក់ arguments...

# preference.profile.title.default_gamepad_control
source: Gamepad controls
km: ការគ្រប់គ្រង Gamepad

# preference.profile.title.default_touch_control
source: Touch controls
km: ការគ្រប់គ្រងការប៉ះ

# preference.profile.title.loader_type
source: Loader type
km: ប្រភេទ Loader

# preference.profile.title.loader_vendor
source: Loader vendor
km: អ្នកលក់ Loader

# preference.profile.title.loader_version
source: Loader version
km: កំណែ Loader

# preference.profile.title.name
source: Name
km: ឈ្មោះ

# preference.profile.title.version
source: Version
km: កំណែ

# preference.profile.title.version_type
source: Version type
km: ប្រភេទកំណែ

# preference.section.control
source: Control customization
km: ការកំណត់ការគ្រប់គ្រងតាមបំណង

# preference.section.debug
source: UI Debugging settings
km: ការកំណត់ UI Debugging

# preference.section.footer.debug
source: You may need to restart the launcher for changes to take effect.
km: អ្នកប្រហែលជាត្រូវចាប់ផ្តើមកម្មវិធីបើកដំណើរការឡើងវិញ ដើម្បីឱ្យការផ្លាស់ប្តូរមានប្រសិទ្ធភាព។

# preference.section.footer.video
source: Auto renderer allows Pojav Patch to choose the best option based on Minecraft version. Decreasing resolution reduces GPU workload for better performance.
km: Auto renderer អនុញ្ញាតឱ្យ Pojav Patch ជ្រើសរើសជម្រើសដ៏ល្អបំផុតដោយផ្អែកលើកំណែ Minecraft។ ការកាត់បន្ថយកម្រិតភាពច្បាស់ជួយកាត់បន្ថយបន្ទុកការងារ GPU សម្រាប់ដំណើរការកាន់តែប្រសើរ។

# preference.section.general
source: General Settings
km: ការកំណត់ទូទៅ

# preference.section.java
source: Java Tweaks
km: ការកែសម្រួល Java

# preference.section.video
source: Video and Audio Settings
km: ការកំណត់វីដេអូ និងសំឡេង

# preference.title.allocated_memory
source: Memory allocation (MB)
km: ការបែងចែកអង្គចងចាំ (MB)

# preference.title.allow_microphone
source: Allow microphone input
km: អនុញ្ញាតឱ្យបញ្ចូលមីក្រូហ្វូន

# preference.title.appicon
source: Set app icon
km: កំណត់រូបតំណាងកម្មវិធី

# preference.title.appicon-dark
source: Familiar Pojav Patch dark
km: Pojav Patch ងងឹត

# preference.title.appicon-default
source: Familiar Pojav Patch light
km: Pojav Patch ភ្លឺ
